app/controllers/home_controller.rb

INSERT INTO "users" ("token", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["token", "1460318498c1f53bb880ce2e6d9ef64b"], ["email", "user@test.com"], ["created_at", "2017-05-13 16:18:03.418591"], ["updated_at", "2017-05-13 16:18:03.418591"]]
---
  def generate_token
    if !params[:email].nil?
      token =  Digest::MD5.hexdigest(params[:email])
      User.create(token: token, email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "1460318498c1f53bb880ce2e6d9ef64b"], ["LIMIT", 1]]
UPDATE "users" SET "counter" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["counter", 1], ["updated_at", "2017-05-14 04:51:58.634783"], ["id", 1]]
---
  def find_duplicates
    @user = User.find_by(token: params[:token])
    lists = params[:data].select{ |e| params[:data].count(e) > 1 }.uniq
    @lists = []
    lists.each do |list, index|
      positions = params[:data].each_index.select { |i| params[:data][i]== "#{list}" }
      @lists << "word: #{list}  #{index} positions: #{positions}"
    end
    if @user
      render json: {code: 200, status: "success", duplicates: @lists}.to_json
      @user.counter += 1
      @user.save!